# 3.Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов».
# Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

# -------------------

# создадим переменную , в которую будем записывать число

percentage1_100 = 1
list_num1 = [1,21,31,41,51,61,71,81,91]
list_num2 = [2,3,4,22,23,24,32,33,34,42,43,44,52,53,54,62,63,64,72,73,74,82,83,84,92,93,94]

while True:
    if percentage1_100 in list_num1:
        print(percentage1_100, "процент")
        percentage1_100 = percentage1_100 + 1
    elif percentage1_100 in list_num2:
        print(percentage1_100, "процентa")
        percentage1_100 = percentage1_100 + 1
    elif percentage1_100 < 100:
        print(percentage1_100, "процентов")
        percentage1_100 = percentage1_100 + 1
    else:
        percentage1_100 == 100
        print(percentage1_100, "процентов")
        print("Готовенько!")
        break
